Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Example 7-2 shows the implementation of a FlatMapFunction with a keyed Value State that checks whether the measured temperature changed more than a config‐ ured threshold.
zh_cn: 示例7-2展示了如何实现带有键值分区ValueState的FlatMapFunction，该函数用来检测温度测量值的变化是否超过配置的阈值。

source: Example 7-2.
zh_cn: 示例7-2，

source: Example 7-3 shows how to implement the previous example with the shortcut.
zh_cn: 示例7-3展示了如何利用简写方式来实现上一个示例。

source: Example 7-3.
zh_cn: 示例7-3，

source: Example 7-4 shows how to implement the ListCheckpointed interface for a function that counts temperature measurements that exceed a threshold per partition, for each
zh_cn: 示例7-4展示了如何利用ListCheckpointed接口实现一个函数，其作用是在每个函数并行实例内，计算该分区数据超过某一阈值的温度值数目。

source: Example 7-4.
zh_cn: 示例7-4，

source: Example 7-5.
zh_cn: 示例7-5，

source: Example 7-6 shows how to implement a tem‐ perature alert application with thresholds that can be dynamically configured via a
zh_cn: 示例7-6展示了如何实现用广播流动态配置阈值的温度报警应用。

source: Example 7-6.
zh_cn: 示例7-6，

source: Example 7-7 shows the implementation of a KeyedBroadcastProcessFunction that supports the dynamic configuration of sensor thresholds at runtime.
zh_cn: 示例7-7展示了一个KeyedBroadcastProcessFunction的实现，它支持在运行时动态配置传感器阈值。

source: Example 7-7.
zh_cn: 示例7-7，

source: Example 7-8 shows how the CheckpointedFunction interface is used to create a func‐ tion with keyed and operator state that counts per key and operator instance how
zh_cn: 示例7-8展示了如何使用CheckpointedFunciton接口创建一个函数，该函数分别利用键值分区状态和算子状态来计算每个键值分区内和每个算子实例内有多少传感器读数超过指定阈值。

source: Example 7-8.
zh_cn: 示例7-8，

source: Example 7-9.
zh_cn: 示例7-9，

source: Example 8-1.
zh_cn: 示例8-1，

source: Example 8-10 shows a simple source function that counts from 0 to Long.MaxValue.
zh_cn: 示例8-10展示了一个简单从0数到Long.MaxValue的数据源函数。

source: Example 8-10.
zh_cn: 示例8-10，

source: Example 8-11 makes the CountSource of Example 8-10 resettable.
zh_cn: 示例8-11为示例8-10中CountSource的可重置版本。

source: Example 8-11.
zh_cn: 示例8-11，

source: Example 8-12 shows a simple SinkFunction that writes sensor readings to a socket.
zh_cn: 示例8-12中展示了一个简单的SinkFunction，它用来将传感读数写入套接字。

source: Example 8-12.
zh_cn: 示例8-12，

source: Example 8-13 illustrates how to implement and use an idempotent SinkFunction that writes to a JDBC database, in this case an embedded Apache Derby database.
zh_cn: 示例8-13展示了如何实现和使用一个利用JDBC写数据库（本例中用到的是Apache Derby数据库）的幂等性SinkFunction。

source: Example 8-13.
zh_cn: 示例8-13，

source: Example 8-14 shows the implementation of a write-ahead sink that writes to the stan‐ dard output.
zh_cn: 示例8-14展示了如何实现一个写标准输出的WAL数据汇。

source: Example 8-14.
zh_cn: 示例8-14，

source: Example 8-15 shows a TwoPhaseCommitSinkFunc tion that writes with exactly-once guarantees to a filesystem.
zh_cn: 示例8-15展示了的TwoPhaseCommitSinkFunction可以将数据以精确一次语义写文件系统。

source: Example 8-15.
zh_cn: 示例8-15，

source: Example 8-16.
zh_cn: 示例8-16，

source: Example 8-17 shows DerbyAsyncFunction, which queries an embedded Derby database via its JDBC interface.
zh_cn: 示例8-17展示的DerbyAsyncFunction可以通过JDBC接口查询嵌入式Derby数据库。

source: Example 8-17.
zh_cn: 示例8-17，

source: Example 8-2.
zh_cn: 示例8-2，

source: Example 8-3 shows how to ingest a stream by reading text files line-wise.
zh_cn: 示例8-3展示了如何通过逐行读取文件来生成一个数据流。

source: Example 8-3.
zh_cn: 示例8-3，

source: Example 8-4 creates a StreamingFileSink with row encoding by providing an Encoder that writes single records to a part file.
zh_cn: 示例8-4创建了一个使用行编码的StreamingFileSink，它提供的编码器会将每一条记录单独写入分块文件中。

source: Example 8-4 shows how to create a StreamingFile Sink with minimal configuration and append it to a stream.
zh_cn: 示例8-4展示了如何使用最少的配置来创建一个StreamingFileSink并将其添加到数据流后面。

source: Example 8-4.
zh_cn: 示例8-4，

source: Example 8-5.
zh_cn: 示例8-5，

source: Example 8-6.
zh_cn: 示例8-6，

source: Example 8-7 shows how to create a sink that writes a DataStream of tuples,
zh_cn: 示例8-7展示了如何创建一个用于将元组、样例类或Row类型的数据流写入Cassandra表的数据汇。

source: Example 8-7, it returns a builder for a Cassandra sink that handles Scala tuples.
zh_cn: 在示例8-7中，会返回一个针对Scala元组的Cassandra数据汇构建器。

source: Example 8-7.
zh_cn: 示例8-7，

source: Example 8-8 shows how to configure a Cassandra sink for a POJO of type
zh_cn: 示例8-8展示了如何为POJO类型SensorReading配置一个Cassandra数据汇。

source: Example 8-8.
zh_cn: 示例8-8，

source: Example 8-9.
zh_cn: 示例8-9，

source: Example 9-1.
zh_cn: 示例9-1，

source: Example 9-2.
zh_cn: 示例9-2，

source: Example 9-3 shows the deployment for worker pods.
zh_cn: 示例9-3展示了工作进程Pod的配置。

source: Example 9-3.
zh_cn: 示例9-3，

source: Example 9-4.
zh_cn: 示例9-4，

source: Example 9-5.
zh_cn: 示例9-5，

source: Examples for source con‐ nectors that support the checkpointing of reading positions are file-based sources that store the reading offsets in the byte stream of the file or a Kafka source that stores the reading offsets in the topic partitions it consumes.
zh_cn: 支持将读取位置写入检查点的数据源连接器有：基于文件的连接器（会存储文件字节流的读取偏移）以及Kafka连接器（会存储消费主题分区的读取偏移）等。

source: Examples of such systems are filesystems that provide the offset of a file stream and a seek method to move a file stream to a specific position or Apache Kafka, which provides offsets for each parti‐ tion of a topic and can set the reading position of a partition.
zh_cn: 例如：文件系统可提供文件流的读取偏移，并支持通过seek方法将文件流移动到特定位置；Apache Kafka可提供主题下每个分区的偏移地址，并允许我们设置分区的读取位置。

source: Except from experiencing network delays, streams might be affected by many other factors resulting in events arriving out-of-order.
zh_cn: 除了遇到网络延迟外，数据流还可能受很多其他因素的影响，从而导致事件乱序到达。

source: Execute
zh_cn: 执行

source: Execute the program.
zh_cn: 执行程序。

source: Executes JDBC query in a thread and handles the resulting Future
zh_cn: 在一个线程内执行JDBC查询并通过异步回调处理产生的Future对象。

source: Explicitly Providing Type Information
zh_cn: 显式提供类型信息

source: Explicitly providing TypeInformation
zh_cn: 显式提供TypeInformation

source: Exposing Queryable State
zh_cn: 对外暴露可查询式状态

source: Exposing metrics
zh_cn: 暴露指标

source: External applications can request the state for a key while the streaming application is running.
zh_cn: 外部应用可以在流式应用运行过程中访问某一键值的状态。

source: Externalized checkpoints do not replace savepoints.
zh_cn: 外化检查点不能替代保存点。

source: Extract the archive file.
zh_cn: 提取归档文件。

source: Extract the archive file:
zh_cn: 解压文件：

source: FIRE_AND_PURGE: Evaluates the window first (FIRE) and subsequently removes all state and metadata (PURGE).
zh_cn: 先进行窗口计算（FIRE），随后删除所有状态及元数据（PURGE）。

source: Fabian Hueske and Vasiliki Kalavri
zh_cn: 费比安·霍斯克，瓦西里基·卡拉夫里

source: Fabian Hueske is a committer to and PMC member of the Apache Flink project and has been contributing to Flink since its earliest days.
zh_cn: 作为最早参与Flink建设的几人之一，费比安·霍斯克Apache Flink项目的Committer及PMC成员。

source: Fabian is cofounder and soft‐ ware engineer at Ververica (formerly data Artisans), a Berlin-based startup that fos‐ ters Flink and its community.
zh_cn: 他同时还是Ververica（前身为data Artisans）的联合创始人和软件工程师。该公司是一家总部位于柏林的创业公司，一直以来都致力于为Flink项目和社区发展提供支持。

source: Field Expressions
zh_cn: 字段表达式

source: Field Positions
zh_cn: 字段位置

source: Field expressions work for tuples, POJOs, and case classes.
zh_cn: 它可用于元组、POJO以及样例类，

source: Figure 1-1.
zh_cn: 图1-1，

source: Figure 1-2 depicts a microservices architecture.
zh_cn: 图1-2展示了一种微服务架构。

source: Figure 1-2.
zh_cn: 图1-2，

source: Figure 1-3.
zh_cn: 图1-3，

source: Figure 1-4.
zh_cn: 图1-4，

source: Figure 1-5 shows a service architecture composed of event-driven streaming applications.
zh_cn: 图1-5粗略展示了一个由事件驱动型应用组成的服务架构。

source: Figure 1-5.
zh_cn: 图1-5，

source: Figure 1-6.
zh_cn: 图1-6，

source: Figure 1-7.
zh_cn: 图1-7，

source: Figure 1-8.
zh_cn: 图1-8，

source: Figure 1-9.
zh_cn: 图1-9，

source: Figure 10-1 shows the JobGraph of the
zh_cn: 图10-1展示了应用的JobGraph以及它的任务到处理槽的映射关系。

source: Figure 10-1.
zh_cn: 图10-1，

source: Figure 10-2 shows an instance of the dashboard home screen.
zh_cn: 图10-2展示了一个仪表盘主界面。

source: Figure 10-2.
zh_cn: 图10-2，

source: Figure 10-3.
zh_cn: 图10-3，

source: Figure 10-4.
zh_cn: 图10-4，

source: Figure 10-5 shows how selected metrics are shown as continuously updated charts.
zh_cn: 图10-5展示了如何使用连续更新的图表展现所选指标。

source: Figure 10-5.
zh_cn: 图10-5，

source: Figure 2-1.
zh_cn: 图2-1

source: Figure 2-10 shows a parallel count- based tumbling window of length 2 that is partitioned by event color.
zh_cn: 图2-10展示了一个按事件颜色划分、基于数量2的并行滚动窗口。

source: Figure 2-10.
zh_cn: 图2-10，

source: Figure 2-11 illustrates this problem.
zh_cn: 图2-11说明了这个问题。

source: Figure 2-11.
zh_cn: 图2-11，

source: Figure 2-12.
zh_cn: 图2-12，

source: Figure 2-13.
zh_cn: 图2-13，

source: Figure 2-2.
zh_cn: 图2-2，

source: Figure 2-3.
zh_cn: 图2-3，

source: Figure 2-4.
zh_cn: 图2-4，

source: Figure 2-5.
zh_cn: 图2-5，

source: Figure 2-6 shows a count-based tumbling window that discretizes the input stream into buckets of four elements.
zh_cn: 图2-6中基于数量的滚动窗口将输入流按每4个元素一组分配到不同的桶中。

source: Figure 2-6.
zh_cn: 图2-6，

source: Figure 2-7.
zh_cn: 图2-7，

source: Figure 2-8.
zh_cn: 图2-8，

source: Figure 2-9.
zh_cn: 图2-9，

source: Figure 3-1 visualizes how Flink’s components interact with each other when an applica‐ tion is submitted for execution.
zh_cn: 图3-1展示了应用提交执行过程中Flink各组件之间的交互过程。

source: Figure 3-1 is a high-level sketch to visualize the responsibilities and interactions of the components of an application.
zh_cn: 图3-1仅是一个用于展示各组件职责与交互的高层次框架。

source: Figure 3-1 shows how Flink’s components interact with each other when an applica‐ tion is submitted for execution.
zh_cn: 图3-1展示了应用提交执行过程中Flink各组件之间的交互过程。

source: Figure 3-1.
zh_cn: 图3-1，

source: Figure 3-10 shows the typical interaction between a task and its state.
zh_cn: 图3-10展示了某个任务和它状态之间的典型交互过程。

source: Figure 3-10.
zh_cn: 图3-10，

source: Figure 3-11 shows how tasks access operator state.
zh_cn: 图3-11展示了任务访问算子状态的过程。

source: Figure 3-11.
zh_cn: 图3-11，

source: Figure 3-12 shows how tasks interact with keyed state.
zh_cn: 图3-12展示了任务和键值分区状态的交互过程。

source: Figure 3-12.
zh_cn: 图3-12

source: Figure 3-13 shows how keyed state is repartitioned in key groups.
zh_cn: 图3-13展示了键值分区状态通过键值组进行重新分区的过程

source: Figure 3-13.
zh_cn: 图3-13，

source: Figure 3-14 shows the redistribution of operator list state.
zh_cn: 图3-14展示了算子列表状态的重分配过程。

source: Figure 3-14.
zh_cn: 图3-14，

source: Figure 3-15 shows how operator union list state is redistributed.
zh_cn: 图3-15展示了算子联合列表状态的重分配过程。

source: Figure 3-15.
zh_cn: 图3-15，

source: Figure 3-16 shows the redistribution of operator broadcast state.
zh_cn: 图3-16展示了算子广播状态的重分配过程。

source: Figure 3-16.
zh_cn: 图3-16，

source: Figure 3-17 shows a consistent checkpoint of a simple application.
zh_cn: 图3-17展示了针对一个简单应用的一致性检查点。

source: Figure 3-17.
zh_cn: 图3-17，

source: Figure 3-18 shows the recovery process.
zh_cn: 图3-18展示了整个恢复过程。

source: Figure 3-18.
zh_cn: 图3-18，

source: Figure 3-19.
zh_cn: 图3-19，

source: Figure 3-2 shows the relationships between Task‐ Managers, slots, tasks, and operators.
zh_cn: 图3-2展示了TaskManager、处理槽、任务以及算子之间的关系。

source: Figure 3-2.
zh_cn: 图3-2，

source: Figure 3-20.
zh_cn: 图3-20，

source: Figure 3-21 shows the streaming application after both source tasks checkpointed their local state and emit‐ ted checkpoint barriers.
zh_cn: 图3-21展示了流式应用为数据源任务的本地状态生成检查点并发出检查点分隔符。

source: Figure 3-21.
zh_cn: 图3-21，

source: Figure 3-22.
zh_cn: 图3-22，

source: Figure 3-23.
zh_cn: 图3-23，

source: Figure 3-24 shows the application at this point.
zh_cn: 图3-24展示了此时的应用状态。

source: Figure 3-24.
zh_cn: 图3-24，

source: Figure 3-25 shows the final step of the checkpointing algorithm.
zh_cn: 图3-25展示了检查点算法的最后一步。

source: Figure 3-25.
zh_cn: 图3-25，

source: Figure 3-26 shows an application with three operators, each running with two tasks.
zh_cn: 图3-26所展示的应用包含了三个算子，每个算子各有两个任务。

source: Figure 3-26.
zh_cn: 图3-26，

source: Figure 3-3.
zh_cn: 图3-3，

source: Figure 3-4 shows this architecture.
zh_cn: 图3-4展示了这一架构.

source: Figure 3-4.
zh_cn: 图3-4，

source: Figure 3-5.
zh_cn: 图3-5，

source: Figure 3-6 depicts how the pipeline is executed with task chaining.
zh_cn: 图3-6展示了流水线如何在任务链接模式下执行。

source: Figure 3-6.
zh_cn: 图3-6，

source: Figure 3-7 shows the same pipeline executed without task chaining.
zh_cn: 图3-7展示了相同的流水线在非任务链接模式下执行。

source: Figure 3-7.
zh_cn: 图3-7，

source: Figure 3-8.
zh_cn: 图3-8，

source: Figure 3-9 shows how a task with four input partitions and three output partitions receives watermarks, updates its partition watermarks and event-time clock, and emits watermarks.
zh_cn: 图3-9展示了一个有4个输入分区和3个输出分区的任务在接收到水位线后，是如何更新它的分区水位线和事件时间时钟，并将水位线发出的。

source: Figure 3-9.
zh_cn: 图3-9，

source: Figure 4-1.
zh_cn: 图4-1，

source: Figure 4-2.
zh_cn: 图4-2，

source: Figure 4-3.
zh_cn: 图4-3，

source: Figure 5-1 shows a map transformation that converts every square into a circle.
zh_cn: 图5-1所示的map转换会将每个方形输入转换为圆形。

source: Figure 5-1.
zh_cn: 图5-1，

source: Figure 5-2.
zh_cn: 图5-2，

source: Figure 5-3 shows a flatMap operation that differentiates its output based on the color of the incoming event.
zh_cn: 图5-3展示的flatMap操作会根据输入事件颜色的不同输出不同的结果。

source: Figure 5-3.
zh_cn: 图5-3，

source: Figure 5-4.
zh_cn: 图5-4，

source: Figure 5-5 shows a union operation that
zh_cn: 图5-5展示的union操作会将黑色和白色的事件合并成一条输出流。

source: Figure 5-5.
zh_cn: 图5-5，

source: Figure 5-6 shows a split operator that routes all white events into a separate stream than the rest.
zh_cn: 图5-6所示的split算子会将所有白色事件和其他事件分别发往不同的数据流。

source: Figure 5-6.
zh_cn: 图5-6

source: Figure 5-7 illustrates the
zh_cn: 图5-7对该分发转换进行了说明。

source: Figure 5-7.
zh_cn: 图5-7，

source: Figure 6-1.
zh_cn: 图6-1，

source: Figure 6-2.
zh_cn: 图6-2，

source: Figure 6-3 illustrates how elements are assigned to session windows.
zh_cn: 图6-3解释了如何将元素分配到会话窗口中。

source: Figure 6-3.
zh_cn: 图6-3，

source: Figure 6-4.
zh_cn: 图6-4，

source: Figure 6-5.
zh_cn: 图6-5，

source: Figure 6-6 depicts this case.
zh_cn: 图6-6描述了该情况。

source: Figure 6-6.
zh_cn: 图6-6，

source: Figure 6-7 shows an interval join of two streams, A and B, that joins an event from A with an event from B if the timestamp of the B event is not less than one hour earlier and not more than 15 minutes later than the timestamp of the A event.
zh_cn: 图6-7展示了两条流（A和B）上基于间隔的Join，如果B中事件的时间戳相较于A中事件的时间戳不早于1小时且不晚于15分钟，则会将两个事件Join起来。

source: Figure 6-7.
zh_cn: 图6-7，

source: Figure 6-8 shows how the window join of the DataStream API works.
zh_cn: 图6-8展示了DataStream API中基于窗口的Join是如何工作的。

source: Figure 6-8.
zh_cn: 图6-8，

source: Figure 7-1 shows the architecture of the queryable state service.
zh_cn: 图7-1展示了可查询式状态服务的架构。

source: Figure 7-1.
zh_cn: 图7-1，

source: Figure 8-1 shows the assignment of partitions to source instances.
zh_cn: 图8-1展示了数据源实例的分区分配情况。

source: Figure 8-1.
zh_cn: 图8-1，

source: Figure 9-1 shows a standalone Flink setup.
zh_cn: 图9-1展示了一个Flink独立集群的搭建过程。

source: Figure 9-1.
zh_cn: 图9-1，

source: Figure 9-2 shows how a job is submitted to a standalone cluster.
zh_cn: 图9-2展示了向独立集群提交作业的过程。

source: Figure 9-2.
zh_cn: 图9-2，

source: Figure 9-3 shows how a Flink job is submitted to a YARN cluster.
zh_cn: 图9-3展示了向YARN集群提交Flink作业的过程。

source: Figure 9-3.
zh_cn: 图9-3，

source: Figure 9-4 shows an idle Flink YARN session setup.
zh_cn: 图9-4展示了一个空闲Flink YARN会话的设置过程。

source: Figure 9-4.
zh_cn: 图9-4，

source: Figure 9-5 shows how a job is executed in Flink’s YARN session mode.
zh_cn: 图9-5展示了如何以会话模式在YARN中执行Flink作业。

source: Figure 9-5.
zh_cn: 示例9-5，

source: Figures 4-1 to 4-3 illustrate the import process.
zh_cn: 图4-1到图4-3展示了导入过程。

source: File System Configuration
zh_cn: 文件系统配置

source: File System Sink Connector
zh_cn: 文件系统汇连接器

source: File System Source Connector
zh_cn: 文件系统源连接器

source: FileInputFormat is a specialized InputFormat to read files from a filesystem.4 A FileInputFormat reads files in two steps.
zh_cn: FileInputFormat是一个专门用来从文件系统中读文件的InputFormat。4 它的读取过程分为两步。

source: Filesystem Configuration
zh_cn: 文件系统配置

source: Filesystem Configuration | 237
zh_cn: 文件系统配置 | 237

source: Filesystem Sink Connector
zh_cn: 文件系统数据汇连接器

source: Filesystem Source Connector
zh_cn: 文件系统数据源连接器

source: Filesystems are commonly used to store large amounts of data in a cost-efficient way.
zh_cn: 文件系统作为一类常见的存储方法，对于大量数据存储的性价比很高。

source: Finally, Chapter 11 contains resources you can use to ask questions, attend Flink- related events, and learn how Flink is currently being used.
zh_cn: 最后在第11章，我们提供了一些资源，以方便你提问、参与Flink相关活动及了解Flink的现实应用场景。

source: Finally, Chapter 11 contains resources you can use to ask questions, attend Flink-related events, and learn what people use Flink for.
zh_cn: 最后在第11章，我们提供了一些资源，以方便你提问、参与Flink相关活动和了解Flink的现实应用场景。

source: Finally, Flink’s Kafka sink can be configured to write message timestamps as sup‐ ported since Kafka 0.10.
zh_cn: 最后要说的是，Flink的Kafka数据汇可以通过配置，为0.10之后版本的Kafka写入消息时间戳。

source: Finally, TwoPhaseCommitSinkFunction defines five functions that need to be imple‐ mented:
zh_cn: 最后我们介绍TwoPhaseCommitSinkFunction中需要实现的五个方法：

source: Finally, by leveraging an event log as input source the complete input of an applica‐ tion is reliably stored and can be deterministically replayed.
zh_cn: 以事件日志作为应用的输入，不但完整可靠，而且还支持精准的数据重放。

source: Finally, if the operator has an incremental aggregation function and a full window function, the full window function is applied on the aggregated value and the result is emitted.
zh_cn: 最后，如果算子同时拥有一个增量聚合函数和一个全量窗口函数，那么后者将作用于前者产生的聚合值上，之后便会发出结果。

source: Finally, processing time windows offer a faithful rep‐ resentation of the streams themselves, might also be a desirable property for some use-cases.
zh_cn: 最后一点，处理时间窗口能够表示数据流自身的真实情况，这可能是某些用例的理想属性。

source: Finally, processing-time windows offer a faithful rep‐ resentation of the streams themselves, which might be a desirable property for some use cases.
zh_cn: 最后，处理时间窗口能够表示数据流自身的真实情况，这可能会在某些用例中派上用场。

source: Finally, the JobManager submits the job’s tasks to the TaskManagers for execution.
zh_cn: 最后，JobManager将作业任务提交至TaskManager执行。

source: Finally, under Configuration, you can inspect the configuration properties of checkpoints, such as the interval and the timeout values set.
zh_cn: 最后在Configuration中，你可以查看有关检查点的配置属性，例如设置的检查点间隔和超时值。

source: Finally, we apply a user-defined function that computes the average temperature on each window.
zh_cn: 最后我们使用了一个用户自定义函数（user-defined function）来计算每个窗口的平均温度。

source: Finally, we apply an onComplete() callback on Future and pass the result (or a possi‐ ble exception) to the ResultFuture handler.
zh_cn: 最终我们调用了Future的onComplete()回调函数，将结果（也可能是异常）传给ResultFuture处理器。

source: Finally, we briefly discuss the evolution of open source stream processors and help you run a streaming application on a local Flink instance.
zh_cn: 最后，我们将简要回顾开源流处理引擎的演变过程，并帮助你在本地Flink实例上运行一个流式应用。

source: Finally, we briefly discuss the evolution of open source stream processors and help you to run a first streaming application on a local Flink instance.
zh_cn: 章节最后，我们会简要回顾开源流处理引擎的衍变，并帮助你在本地Flink实例上运行第一个流式应用。

source: Finally, we discussed the most important configuration options.
zh_cn: 最后我们讨论了几个重要的配置选项。

source: Finally, we explain how Flink’s highly available mode works.
zh_cn: 最后，我们将解释Flink高可用模式的工作原理。

source: Finally, we explain how Flink’s highly-available mode works.
zh_cn: 最后，我们会解释Flink高可用模式的工作原理。

source: Finally, we learned why state is important in streaming applications and how to guard it against failures and guarantee correct results.
zh_cn: 最后我们了解了状态对流式应用的重要性，以及如何应对故障并确保结果正确。

source: Finally, we say a big thank you to all the people at O’Reilly who accompanied us on our two and a half year long journey and helped us to push this project over the fin‐ ish line.
zh_cn: 最后，我们由衷地感谢O'Reilly的相关工作人员：Alicia Young、Colleen Lobner、Christine Edwards、Katherine Tozer、Marie Beaugureau以及Tim McGovern，感谢你们在这两年半旅途中的陪伴，一起协助我们完成这个项目。

source: Finally, we show how to bootstrap a Flink Maven project, the starting point for a new application.
zh_cn: 本章最后我们会介绍如何创建Flink Maven项目，这通常是任何一个新应用的起点。

source: Finally, we show how to configure keyed state as queryable and how to access it from an external application.
zh_cn: 最后，我们将展示怎样将键值分区状态设置为可查询式的以及如何从外部应用中访问它们。

source: Finally, we took a look at Apache Flink and the extensive features it offers and showed how to install a local Flink setup and run a first stream processing application.
zh_cn: 最后我们简单了解了Apache Flink以及它提供的诸多特性，还展示了如何在本地安装设置Flink并运行第一个流处理应用。

source: Finally, we will discuss how to join streams on time and strategies to handle late events.
zh_cn: 最后我们会讨论如何基于时间对数据流进行Join以及处理延迟事件的策略。

source: Finally, you can enable and configure local recovery for a Flink cluster by default.7 To enable local recovery, set the parameter state.backend.local-recovery to true.
zh_cn: 最后，你可以通过将参数state.backend.local-recovery设置true，来让Flink集群默认启用和配置本地恢复。

source: Finally, you have seen why state is important in streaming applications and how you can guard it against failures and guarantee correct results.
zh_cn: 最后你明白了状态对流式应用的重要性，以及如何在故障时保证结果正确。

source: Finally, you might also want to configure what happens if a checkpoint fails.
zh_cn: 最后，你可能还希望在检查点失败后可以触发些什么。

source: Finally, you should stop the local Flink cluster.
zh_cn: 最后别忘了停止本地Flink集群。

source: Finally, you should stop the local Flink cluster:
zh_cn: 最后别忘了停止本地Flink集群。

source: First it scans a filesystem path and creates so-called input splits for all matching files.
zh_cn: 首先，它会扫描文件系统的路径并为所有满足条件的文件创建一些所谓的输入划分（input split）。

source: First of all, it requires two semantically equivalent implementations of the application logic for two separate processing sys‐ tems with different APIs.
zh_cn: 首先，该架构需要在拥有不同API的两套独立处理系统之上实现两次语义相同的应用逻辑；

source: First of all, it requires two semantically equivalent implementations of the application logic for two separate processing systems with different APIs.
zh_cn: 首先，该架构需要在拥有不同API的两套独立处理系统之上实现两套语义相同的应用逻辑；

source: First of all, the worker deployment specifies two replicas, which means that two worker containers are started.
zh_cn: 首先，工作进程的Deployment指定了两个副本，因此会启动两个工作容器。

source: First research prototypes and com‐ mercial products date back to the late 1990s.
zh_cn: 它最初的原型和商业产品可以追溯到上世纪90年代。

source: First, Flink compares the unique operator identifiers of the savepoint and application’s operators.
zh_cn: 首先，Flink会对保存点中的唯一算子标识和应用算子内的进行比较。

source: First, a savepoint of a running application is taken and then it is used to restore the state in a starting application.
zh_cn: 首先为正在运行的应用生成一个保存点，然后在应用启动时用它去初始化状态。

source: First, it means that the regular data processing of the application will always compete for resources with the concurrent checkpoint‐ ing.
zh_cn: 首先它意味着应用内常规的数据处理将始终和并发的检查点生成争夺资源。

source: First, it needs to restart failed pro‐ cesses and second, it needs to restart the application and recover its state.
zh_cn: 一是需要重启故障进程，二是需要重启应用并恢复其状态。

source: First, it should be clear that there is an optimal latency in the case of no load.
zh_cn: 首先需要明确的是，在空负载的情况下延迟会达到最优。

source: First, it should be clear that there is optimal latency when there is no load.
zh_cn: 首先需要明确的是，在空负载的情况下延迟会达到最优。

source: First, let’s discuss the software you need to develop Flink applications.
zh_cn: 首先我们来讨论一下开发Flink应用所需的软件。

source: First, let’s have a look at the data type we will be using to represent sensor readings:
zh_cn: 首先来看一下传感器读取数据的数据类型：

source: First, the sink persistently stores the infor‐ mation that the checkpoint was committed and secondly it removes the records from the WAL.
zh_cn: 首先，数据汇需要将检查点已提交的信息持久化；随后，它会从WAL中删除相应的记录。

source: First, we will learn how to define time characteristics, timestamps, and watermarks.
zh_cn: 本章，我们将首先讲解如何定义时间特征、时间戳及水位线。

source: First, you can extend a function class to explicitly provide the TypeInformation of its return type by implementing the ResultTypeQueryable interface.
zh_cn: 首先你可以通过实现ResultTypeQueryable接口来扩展函数，在其中提供返回类型的TypeInformation。

source: First, you can parti‐ tion your input data and have tasks of the same operation execute on the data subsets in parallel.
zh_cn: 首先，你可以将输入数据分组，让同一操作的多个任务并发执行在不同数据子集上，

source: First, you need to configure the hosts and ports of all ZooKeeper processes involved in the
zh_cn: 首先，你需要在./conf/zoo.cfg文件里配置集群中全部ZooKeeper进程的主机和端口。
